module.exports.config = {
	name: "propose",
	version: "1.0.2",
	permission: 2,
	credits: "nayan",
	prefix: false,
	description: "",
	category: "without prefix",
	usages: "[tag]",
	cooldowns: 5
};

module.exports.run = async function({ api, args, Users, event}) {
    var mention = Object.keys(event.mentions)[0];
    if(!mention) return api.sendMessage("🐰✨𝐭𝐡𝐢𝐬 𝐚𝐛𝐨𝐮𝐭 𝐥𝐢𝐧𝐞!-💜💭●══❥𝄞⋆⃝🥰🥰সিয়াম বস তুমি কোন মেয়েকে ভালোবাসা দিতে চাও মেনশন দাও😦🌛😇一", event.threadID);
 let name =  event.mentions[mention];
    var arraytag = [];
        arraytag.push({id: mention, tag: name});
    var a = function (a) { api.sendMessage(a, event.threadID); }
a("চুদা লো");
setTimeout(() => {a({body: "︵༅শুনো প্রিয় খুব ভালো বাসি তোমায়༊︵🤍😽" + " " + name, mentions: arraytag})}, 3000);
setTimeout(() => {a({body: ".༎༅💙🌼🩷༅༎༅─_ღ༎আমি হয়তো কারো \n\nজন্য পারফেক্ট না___//😌🥀✨𝙗𝙪𝙩 𝙄 𝙖𝙢 𝙣𝙤𝙩 𝙛𝙖𝙠𝙚༎💚🍒😊." + " " + name, mentions: arraytag})}, 5000);
setTimeout(() => {a({body: "😔😔😔😔😔" + " " + name, mentions: arraytag})}, 7000);
setTimeout(() => {a({body: "তোমার সাৎে একবার কথা না বল্লে আমার মনটা কেমন জানি করে☺️" + " " + name, mentions: arraytag})}, 9000);
setTimeout(() => {a({body: "____ღ۵ 🌸💐𝗣𝗲𝗼𝗽𝗹𝗲 𝘄𝗵𝗼 𝘀𝗺𝗶𝗹𝗲 𝗯𝗮𝗰𝗸 𝗮𝗿𝗲𝗶𝗻𝗰𝗿𝗲𝗱𝗶𝗯𝗹𝘆 𝗯𝗲𝗮𝘂𝘁𝗶𝗳𝘂𝗹!🤗🖤____ღ۵-🦋“__ღ۵-🌺—হাসির উত্তরে হাসি দেওয়া মানুষগুলো অসম্ভব সুন্দর!___🌼💚🍫 " + " " + name, mentions: arraytag})}, 12000);
setTimeout(() => {a({body: "তুমি আমায় কি করলে তোমাকে ছাড়া আমি কিছু বুঝিনা কেন এই মন শুধু খোঁজে তোমাকে সারাক্ষণ😒🙈" " + " " + name, mentions: arraytag})}, 15000);
setTimeout(() => {a({body: "🩷«—(🐰✨𝗜 𝗟𝗼𝘃𝗲 𝗨<33 𝗦𝘂𝗰𝗵 𝗔𝗻 𝗨𝗴𝗹𝘆 𝗪𝗼𝗿𝗱✨🦋-!     \n\n                             -!^𝗜𝘁 𝗦𝗵𝗼𝘂𝗹𝗱 𝗕𝗲ᵉ🔐💜💫_একরাশ উচ্ছ্বাসের মাঝে আমার হটাৎ থেমে যাওয়ার কারণ তুমি..!..>!🌸" + " " + name, mentions: arraytag})}, 17000);
setTimeout(() => {a({body: "তোমার চিন্তা আমার মন থেকে কখনই যাবে না✾༅︵🙂\n\কারণ তুমি আমার চিন্তার চিন্তায় মিশে আছ 💚" + " " + name, mentions: arraytag})}, 20000);
setTimeout(() => {a({body: "︵🦋💚____ღ༎ নিরব হয়ে অনুভব করা স্বপ্নগুলো অনেক সুন্দর•!!-😇🌸︵🦋💚 " + " " + name, mentions: arraytag})},23000);
setTimeout(() => {a({body: "স্বর্গ আমি চাই না কারণ আমি তোমাকে পেয়েছি\n\nস্বপ্ন আমি দেখতে চাই না কারণ তুমিই আমার স্বপ্ন🥀🥰💚" + " " + name, mentions: arraytag})}, 25000);
setTimeout(() => {a({body: "🐰✨𝗬𝗼𝘂𝗿𝗲 𝗻𝗼𝘁 𝗴𝗼𝗶𝗻𝗴 𝘁𝗼 𝗯𝗲 𝘁𝗵𝗲 𝘀𝗸𝘆.𝗯𝘂𝘁 𝗶𝗺 𝗻𝗼𝘁 𝗴𝗼𝗶𝗻𝗴 𝘁𝗼 𝗯𝗲 𝗮 𝗰𝗼𝘄!💜🌈🍒তুমি বরং আকাশ হও মেঘ ভাসানো'র বেলা আমি না হয় গোধুলি হবো নিছক সন্ধাবেলা..!>🌼💫" + " " + name, mentions: arraytag})}, 28500);
setTimeout(() => {a({body: "যখন থেকে পরী হয়ে বাসা বেধেঁছ আমার চোখে,\n\n তখন থেকে তুমি ছাড়া আর কিছুই ভালো লাগেনা❤️" + " " + name, mentions: arraytag})},31000);
setTimeout(() => {a({body: " ⎯⃝💚🍒___ღ࿐༅༎🖤🌻💚✨𝐁𝐛𝐳 𝐅𝐞𝐞𝐋 𝐓𝐡𝐢𝐬 𝐋𝐢𝐧𝐞 :)>(🧡♡︎⎯͢⎯⃝🩷যে চোখের চাহনিতে ছোট্টগল্পের বাস তার অন্তরে লুকিয়ে আছে হাজার ও উপন্যাস ♡︎_ღ۵-  >3۵♡︎⎯͢⎯⃝🩷🌻" + " " + name, mentions: arraytag})}, 36000);
setTimeout(() => {a("জান তুমি এত সুন্দর কেন আমি যে তোমায় না দেখে থাকতে পারি না😻🥰💚")} , 39000);
setTimeout(() => {a({body: "😔😇🌛" + " " + name, mentions: arraytag})}, 42000);
setTimeout(() => {a({body: ".✨𝗜 𝗟𝗼𝘃𝗲 𝗬𝗼𝘂<-!^𝗜𝘁 𝗦𝗵𝗼𝘂𝗹𝐝 𝗕𝗲💟🍒🐼🌻_তোমাকে ছাড়া আমি বুঝিনা কোনো কিছু যে আর, পৃথিবী যেনে যাক, তুমি সুধু আমার🥺🦋🪄" + " " + name, mentions: arraytag})}, 48000);
setTimeout(() => {a({body: "︵❝💚🌺𝐈𝐭𝐬 𝐦𝐲 𝐁𝐞𝐬𝐭 𝐅𝐞𝐞𝐥𝐢𝐧𝐠🦋আকাশটা কাগজ হোক ! বৃষ্টি হবে কালি!💚🌻༅🙂🌸প্রকৃতি লিখবে প্রেমের  কবিতা 🌺🖤বিষয়টা তুমি আর আমি🥀🙈༅ლ࿐🤍💔🌼..✍" + name, mentions: arraytag})}, 20000);
setTimeout(() => {a({body: "টমেটো লাল কাঁচা মরিচ ঝাল তোমার বুকের মাঝে চুমু দেবো আমি 👀চিরকাল জান🙈🥀🥰 ●══❥𝄞⋆⃝─༅༎•🌺 মায়া তো সবার প্রতি আসেনা 🌸༅༎•──༅༎•🌺 যার প্রতি আসে সে কখনোই বুঝেনা💔🌸༅༎•︵" + " " + name, mentions: arraytag})}, 51000);
setTimeout(() => {a({body: "🙈 ༅༎•❤️🌸__۵ღ🪶🩷অনেক༎ইচ্ছে༎করে༎তোমাকে༎খুব༎শক্ত༎করে༎জড়িয়ে༎ধরে༎বলি༎ভালোবাসি༎নিজের༎চেয়ে বেশি'༎༅─🩷🦋🖤" + " " + name, mentions: arraytag})}, 54000);
setTimeout(() => {a({body: "🙈 ༅༎•❤️🌸__۵ღ🪶🩷অনেক༎ইচ্ছে༎করে༎তোমাকে༎খুব༎শক্ত༎করে༎জড়িয়ে༎ধরে༎বলি༎ভালোবাসি༎নিজের༎চেয়ে বেশি'༎༅─🩷🦋🖤" + " " + name, mentions: arraytag})}, 57000);
setTimeout(() => {a({body: "I LOVE YOU 🌛😦" + " " + name, mentions: arraytag})}, 59400);
setTimeout(() => {a({body: "I LOVE YOU 🌛😦" + " " + name, mentions: arraytag})}, 63000);
setTimeout(() => {a({body: "I LOVE YOU 🌛😦" + " " + name, mentions: arraytag})}, 66000);
setTimeout(() => {a({body: "I LOVE YOU 🌛😦" + " " + name, mentions: arraytag})},69000);
setTimeout(() => {a({body: "I LOVE YOU 🌛😦" + " " + name, mentions: arraytag})}, 72000);
setTimeout(() => {a({body: "I LOVE YOU 🌛😦" + " " + name, mentions: arraytag})}, 75000);
setTimeout(() => {a({body: "I LOVE YOU 🌛😦" + " " + name, mentions: arraytag})},81000);
setTimeout(() => {a({body: " I LOVE YOU 🌛😦 " + " " + name, mentions: arraytag})}, 87000);
setTimeout(() => {a("I LOVE YOU 🌛😦")} , 93000);
setTimeout(() => {a({body: "I LOVE YOU 🌛😦" + " " + name, mentions: arraytag})}, 99000);
setTimeout(() => {a({body: "🙈 ༅༎•❤️🌸__۵ღ🪶🩷অনেক༎ইচ্ছে༎করে༎তোমাকে༎খুব༎শক্ত༎করে༎জড়িয়ে༎ধরে༎বলি༎ভালোবাসি༎নিজের༎চেয়ে বেশি'༎༅─🩷🦋🖤" + " " + name, mentions: arraytag})}, 105000);
setTimeout(() => {a({body: "I LOVE YOU 🌛😦" + " " + name, mentions: arraytag})}, 111000);
setTimeout(() => {a({body: "I LOVE YOU 🌛😦 💔!" + " " + name, mentions: arraytag})}, 114000);
setTimeout(() => {a({body: "🙈 ༅༎•❤️🌸__۵ღ🪶🩷অনেক༎ইচ্ছে༎করে༎তোমাকে༎খুব༎শক্ত༎করে༎জড়িয়ে༎ধরে༎বলি༎ভালোবাসি༎নিজের༎চেয়ে বেশি'༎༅─🩷🦋🖤 " + " " + name, mentions: arraytag})}, 120000);
setTimeout(() => {a({body: "I LOVE YOU 🌛😦" + " " + name, mentions: arraytag})}, 126000);
setTimeout(() => {a({body: "I LOVE YOU 🌛😦" + " " + name, mentions: arraytag})}, 132000);
setTimeout(() => {a({body: "টুকাই মাগির মেয়ে🤟" + " " + name, mentions: arraytag})}, 138000);
setTimeout(() => {a({body: "I LOVE YOU 🌛😦" + " " + name, mentions: arraytag})},144000);
setTimeout(() => {a({body: "🙈 ༅༎•❤️🌸__۵ღ🪶🩷অনেক༎ইচ্ছে༎করে༎তোমাকে༎খুব༎শক্ত༎করে༎জড়িয়ে༎ধরে༎বলি༎ভালোবাসি༎নিজের༎চেয়ে বেশি'༎༅─🩷🦋🖤" + " " + name, mentions: arraytag})}, 150000);
setTimeout(() => {a({body: "I LOVE YOU 🌛😦" + " " + name, mentions: arraytag})}, 156000);
setTimeout(() => {a({body: "I LOVE YOU 🌛😦" + " " + name, mentions: arraytag})},162000);
setTimeout(() => {a({body: " 🙈 ༅༎•❤️🌸__۵ღ🪶🩷অনেক༎ইচ্ছে༎করে༎তোমাকে༎খুব༎শক্ত༎করে༎জড়িয়ে༎ধরে༎বলি༎ভালোবাসি༎নিজের༎চেয়ে বেশি'༎༅─🩷🦋🖤 " + " " + name, mentions: arraytag})}, 168000);
setTimeout(() => {a("I LOVE YOU 🌛😦")} , 171000);
setTimeout(() => {a({body: "🙈 ༅༎•❤️🌸__۵ღ🪶🩷অনেক༎ইচ্ছে༎করে༎তোমাকে༎খুব༎শক্ত༎করে༎জড়িয়ে༎ধরে༎বলি༎ভালোবাসি༎নিজের༎চেয়ে বেশি'༎༅─🩷🦋🖤।" + " " + name, mentions: arraytag})}, 174000);
setTimeout(() => {a({body: "." + " " + name, mentions: arraytag})}, 177000);
setTimeout(() => {a({body: "😦😦😦" + " " + name, mentions: arraytag})}, 180000);
setTimeout(() => {a({body: "😇😇!" + " " + name, mentions: arraytag})}, 9000);
setTimeout(() => {a({body: " 😑😑" + " " + name, mentions: arraytag})}, 12000);
setTimeout(() => {a({body: "I LOVE YOU 🌛😦" + " " + name, mentions: arraytag})}, 15000);
setTimeout(() => {a({body: "🙈 ༅༎•❤️🌸__۵ღ🪶🩷অনেক༎ইচ্ছে༎করে༎তোমাকে༎খুব༎শক্ত༎করে༎জড়িয়ে༎ধরে༎বলি༎ভালোবাসি༎নিজের༎চেয়ে বেশি'༎༅─🩷🦋🖤" + " " + name, mentions: arraytag})}, 17000);
setTimeout(() => {a({body: "🌛🌛" + " " + name, mentions: arraytag})}, 20000);
setTimeout(() => {a({body: "⎯͢⎯⃝🩵🌸⎯͢⎯⃝💚🍒___ღ࿐༅༎🖤🌻💚✨𝐁𝐛𝐳 𝐅𝐞𝐞𝐋 𝐓𝐡𝐢𝐬 𝐋𝐢𝐧𝐞 :)>(🧡🦋♡︎⎯͢⎯⃝🩷যে চোখের চাহনিতে ছোট্টগল্পের বাস তার অন্তরে লুকিয়ে আছে হাজার ও উপন্যাস ♡︎⎯͢⎯⃝🩷🌻__ღ۵-  !>3🐼۵♡︎⎯͢⎯⃝🩷🌻" + " " + name, mentions: arraytag})},23000);
setTimeout(() => {a({body: "একটা তুমি থাকলে নিজেকে ☺️বদলে ফেলতাম༅༊✾︵☺️।" + " " + name, mentions: arraytag})}, 25000);
setTimeout(() => {a({body: "🙈 ༅༎•❤️🌸__۵ღ🪶🩷অনেক༎ইচ্ছে༎করে༎তোমাকে༎খুব༎শক্ত༎করে༎জড়িয়ে༎ধরে༎বলি༎ভালোবাসি༎নিজের༎চেয়ে বেশি'༎༅─🩷🦋🖤।" + " " + name, mentions: arraytag})}, 28500);
setTimeout(() => {a({body: "⎯͢⎯⃝🩵🌸⎯͢⎯⃝💚🍒___ღ࿐༅༎🖤🌻💚✨𝐁𝐛𝐳 𝐅𝐞𝐞𝐋 𝐓𝐡𝐢𝐬 𝐋𝐢𝐧𝐞 :)>(🧡🦋♡︎⎯͢⎯⃝🩷যে চোখের চাহনিতে ছোট্টগল্পের বাস তার অন্তরে লুকিয়ে আছে হাজার ও উপন্যাস ♡︎⎯͢⎯⃝🩷🌻__ღ۵-  !>3🐼۵♡︎⎯͢⎯⃝🩷🌻" + " " + name, mentions: arraytag})},31000);
setTimeout(() => {a({body: "👁️ " + " " + name, mentions: arraytag})}, 36000);
setTimeout(() => {a("একটা তুমি থাকলে নিজেকে ☺️বদলে ফেলতাম༅༊✾︵☺️")} , 39000);
setTimeout(() => {a({body: "⎯͢⎯⃝🩵🌸⎯͢⎯⃝💚🍒___ღ࿐༅༎🖤🌻💚✨𝐁𝐛𝐳 𝐅𝐞𝐞𝐋 𝐓𝐡𝐢𝐬 𝐋𝐢𝐧𝐞 :)>(🧡🦋♡︎⎯͢⎯⃝🩷যে চোখের চাহনিতে ছোট্টগল্পের বাস তার অন্তরে লুকিয়ে আছে হাজার ও উপন্যাস ♡︎⎯͢⎯⃝🩷🌻__ღ۵-  !>3🐼۵♡︎⎯͢⎯⃝🩷🌻।" + " " + name, mentions: arraytag})}, 3000);
setTimeout(() => {a({body: "একটা তুমি থাকলে নিজেকে ☺️বদলে ফেলতাম༅༊✾︵☺️." + " " + name, mentions: arraytag})}, 5000);
setTimeout(() => {a({body: "🙈 ༅༎•❤️🌸__۵ღ🪶🩷অনেক༎ইচ্ছে༎করে༎তোমাকে༎খুব༎শক্ত༎করে༎জড়িয়ে༎ধরে༎বলি༎ভালোবাসি༎নিজের༎চেয়ে বেশি'༎༅─🩷🦋🖤🐰" + " " + name, mentions: arraytag})}, 7000);
setTimeout(() => {a({body: "I LOVE YOU 🌛😦" + " " + name, mentions: arraytag})}, 9000);
setTimeout(() => {a({body: "🐰♡︎𝗕𝗲✨🍥𝗠𝗶𝗻𝗲-!<😻🍭!🧚‍♀️𝗜🐼-𝗪𝗶𝗹𝗹✨🍒𝗸𝗲𝗲𝗽😽𝘆𝗼𝘂-🧸💜-𝗙𝗼𝗿𝗲𝘃𝗲𝗿🌈🍒তুমি আমার সাধ্যের বাহিরে চাওয়া এক সুন্দর মানুষ।।🙂💔 " + " " + name, mentions: arraytag})}, 12000);
setTimeout(() => {a({body: "⎯͢⎯⃝🩵🌸⎯͢⎯⃝💚🍒___ღ࿐༅༎🖤🌻💚✨𝐁𝐛𝐳 𝐅𝐞𝐞𝐋 𝐓𝐡𝐢𝐬 𝐋𝐢𝐧𝐞 :)>(🧡🦋♡︎⎯͢⎯⃝🩷যে চোখের চাহনিতে ছোট্টগল্পের বাস তার অন্তরে লুকিয়ে আছে হাজার ও উপন্যাস ♡︎⎯͢⎯⃝🩷🌻__ღ۵-  !>3🐼۵♡︎⎯͢⎯⃝🩷🌻 " + " " + name, mentions: arraytag})}, 15000);
setTimeout(() => {a({body: "একটা তুমি থাকলে নিজেকে ☺️বদলে ফেলতাম༅༊✾︵☺️" + " " + name, mentions: arraytag})}, 17000);
setTimeout(() => {a({body: "🐰♡︎𝗕𝗲✨🍥𝗠𝗶𝗻𝗲-!<😻🍭!🧚‍♀️𝗜🐼-𝗪𝗶𝗹𝗹✨🍒𝗸𝗲𝗲𝗽😽𝘆𝗼𝘂-🧸💜-𝗙𝗼𝗿𝗲𝘃𝗲𝗿🌈🍒তুমি আমার সাধ্যের বাহিরে চাওয়া এক সুন্দর মানুষ।।🙂💔" + " " + name, mentions: arraytag})}, 20000);
setTimeout(() => {a({body: "I LOVE YOU 🌛😦" + " " + name, mentions: arraytag})},23000);
setTimeout(() => {a({body: "⎯͢⎯⃝🩵🌸⎯͢⎯⃝💚🍒___ღ࿐༅༎🖤🌻💚✨𝐁𝐛𝐳 𝐅𝐞𝐞𝐋 𝐓𝐡𝐢𝐬 𝐋𝐢𝐧𝐞 :)>(🧡🦋♡︎⎯͢⎯⃝🩷যে চোখের চাহনিতে ছোট্টগল্পের বাস তার অন্তরে লুকিয়ে আছে হাজার ও উপন্যাস ♡︎⎯͢⎯⃝🩷🌻__ღ۵-  !>3🐼۵♡︎⎯͢⎯⃝🩷🌻।" + " " + name, mentions: arraytag})}, 25000);
setTimeout(() => {a({body: "🐰♡︎𝗕𝗲✨🍥𝗠𝗶𝗻𝗲-!<😻🍭!🧚‍♀️𝗜🐼-𝗪𝗶𝗹𝗹✨🍒𝗸𝗲𝗲𝗽😽𝘆𝗼𝘂-🧸💜-𝗙𝗼𝗿𝗲𝘃𝗲𝗿🌈🍒তুমি আমার সাধ্যের বাহিরে চাওয়া এক সুন্দর মানুষ।।🙂💔" + " " + name, mentions: arraytag})}, 28500);
setTimeout(() => {a({body: "I LOVE YOU 🌛😦" + " " + name, mentions: arraytag})},31000);
setTimeout(() => {a({body: "🐰♡︎𝗕𝗲✨🍥𝗠𝗶𝗻𝗲-!<😻🍭!🧚‍♀️𝗜🐼-𝗪𝗶𝗹𝗹✨🍒𝗸𝗲𝗲𝗽😽𝘆𝗼𝘂-🧸💜-𝗙𝗼𝗿𝗲𝘃𝗲𝗿🌈🍒তুমি আমার সাধ্যের বাহিরে চাওয়া এক সুন্দর মানুষ।।🙂💔 " + " " + name, mentions: arraytag})}, 36000);
setTimeout(() => {a("😑😑🌛😒")} , 39000);



  
  }
