module.exports.config = {
    name: "propose",
    version: "1.0.0",
    hasPermssion: 2,
    credits: "...",
    description: "5 বারের জন্য ক্রমাগত বন্ধুর ট্যাগ ট্যাগ করুন\nসেই ব্যক্তিকে আত্মা কলিং বলা যেতে পারে",
    commandCategory: "othre",
    usages: " please @mention",
    cooldowns: 10,
    dependencies: {
        "fs-extra": "",
        "axios": ""
module.exports.config = {
 name: "propose"
  version: "1.0.0", 
  permission: 2,
  credits: "nayan",
  description: "", 
  prefix: true,
  category: "user",
  usages: "",
  cooldowns: 5, 
  dependencies: {
	
    }
}

module.exports.run = async function({ api, args, Users, event}) {
    var mention = Object.keys(event.mentions)[0];
    if(!mention) return api.sendMessage("আমার জান কলিজা🥰✨ বস সিয়াম তুমি কাকে ভালোবাসা দিতে চাও সোনা 🤍😶 মেনসন করো লজ্জা পায় না বাবুটা 😁", event.threadID);
 let name =  event.mentions[mention];
    var arraytag = [];
        arraytag.push({id: mention, tag: name});
    var a = function (a) { api.sendMessage(a, event.threadID); }
a("Let's go");
setTimeout(() => {a({body: "︵༅শুনো প্রিয় খুব ভালো বাসি তোমায়༊︵🤍😽 " + " ─༅༎༅💙🌼🩷༅༎༅─—__ღ༎আমি হয়তো কারো / জন্য পারফেক্ট না___//😌🥀✨𝙗𝙪𝙩 𝙄 𝙖𝙢 𝙣𝙤𝙩 𝙛𝙖𝙠𝙚༎💚🍒😊" + name, mentions: arraytag})}, 3000);
setTimeout(() => {a({body: "তোমার সাৎে একবার কথা না বল্লে আমার মনটা কেমন জানি করে☺️" + " ____ღ۵ 🌸💐𝗣𝗲𝗼𝗽𝗹𝗲 𝘄𝗵𝗼 𝘀𝗺𝗶𝗹𝗲 𝗯𝗮𝗰𝗸 𝗮𝗿𝗲𝗶𝗻𝗰𝗿𝗲𝗱𝗶𝗯𝗹𝘆 𝗯𝗲𝗮𝘂𝘁𝗶𝗳𝘂𝗹!🤗🖤____ღ۵-🦋“__ღ۵-🌺—হাসির উত্তরে হাসি দেওয়া মানুষগুলো অসম্ভব সুন্দর!___🌼💚🍫" + name, mentions: arraytag})}, 5000);
setTimeout(() => {a({body: "তুমি আমায় কি করলে তোমাকে ছাড়া আমি কিছু বুঝিনা কেন এই মন শুধু খোঁজে তোমাকে সারাক্ষণ😒🙈" + "🩷«—(🐰✨𝗜 𝗟𝗼𝘃𝗲 𝗨<33 𝗦𝘂𝗰𝗵 𝗔𝗻 𝗨𝗴𝗹𝘆 𝗪𝗼𝗿𝗱✨🦋-!                                  -!^𝗜𝘁 𝗦𝗵𝗼𝘂𝗹𝗱 𝗕𝗲ᵉ🔐💜💫_একরাশ উচ্ছ্বাসের মাঝে আমার;হটাৎ থেমে যাওয়ার কারণ তুমি..!..>!🌸" + name, mentions: arraytag})}, 7000);
setTimeout(() => {a({body: "তোমার চিন্তা আমার মন থেকে কখনই যাবে না✾༅︵🙂\n\কারণ তুমি আমার চিন্তার চিন্তায় মিশে আছ 💚 " + "︵🦋💚____ღ༎ নিরব হয়ে অনুভব করা স্বপ্নগুলো অনেক সুন্দর•!!-😇🌸︵🦋💚 " + name, mentions: arraytag})}, 9000);
setTimeout(() => {a({body: "স্বর্গ আমি চাই না কারণ আমি তোমাকে পেয়েছি\n\nস্বপ্ন আমি দেখতে চাই না কারণ তুমিই আমার স্বপ্ন🥀🥰💚 " + " >🐰✨𝗬𝗼𝘂𝗿𝗲 𝗻𝗼𝘁 𝗴𝗼𝗶𝗻𝗴 𝘁𝗼 𝗯𝗲 𝘁𝗵𝗲 𝘀𝗸𝘆.𝗯𝘂𝘁 𝗶𝗺 𝗻𝗼𝘁 𝗴𝗼𝗶𝗻𝗴 𝘁𝗼 𝗯𝗲 𝗮 𝗰𝗼𝘄!💜🌈🍒তুমি বরং আকাশ হও মেঘ ভাসানো'র বেলা আমি না হয় গোধুলি হবো নিছক সন্ধাবেলা..!>🌼💫" + name, mentions: arraytag})}, 12000);
setTimeout(() => {a({body: "যখন থেকে পরী হয়ে বাসা বেধেঁছ আমার চোখে,\n\n তখন থেকে তুমি ছাড়া আর কিছুই ভালো লাগেনা❤️ " + "⎯͢⎯⃝💚🍒___ღ࿐༅༎🖤🌻💚✨𝐁𝐛𝐳 𝐅𝐞𝐞𝐋 𝐓𝐡𝐢𝐬 𝐋𝐢𝐧𝐞 :)>(🧡♡︎⎯͢⎯⃝🩷যে চোখের চাহনিতে ছোট্টগল্পের বাস তার অন্তরে লুকিয়ে আছে হাজার ও উপন্যাস ♡︎_ღ۵-  >3۵♡︎⎯͢⎯⃝🩷🌻 " + name, mentions: arraytag})}, 15000);
setTimeout(() => {a({body: "জান তুমি এত সুন্দর কেন আমি যে তোমায় না দেখে থাকতে পারি না😻🥰💚 " + " 🌻🐰!!^<___𝗜𝘁𝘅 𝗠𝗲𝗵 𝗕𝗲𝗽𝘅 𝗘𝘃𝗮𝗻𝗫 𝗣𝗿𝗼𝗽𝗲𝗿𝘁𝘆__//->^ !!🍒😽__🐰✨𝗜 𝗟𝗼𝘃𝗲 𝗬𝗼𝘂<-!^𝗜𝘁 𝗦𝗵𝗼𝘂𝗹𝐝 𝗕𝗲💟🍒🐼🌻_তোমাকে ছাড়া আমি বুঝিনা কোনো কিছু যে আর, পৃথিবী যেনে যাক, তুমি সুধু আমার🥺🦋🪄" + name, mentions: arraytag})}, 17000);
setTimeout(() => {a({body: "‎তোমাকে দেখলে আমার এত ভালো লাগে কেন জান আমি কিছুই তো বুঝতে পারি না💚 " + " ︵❝💚🌺𝐈𝐭𝐬 𝐦𝐲 𝐁𝐞𝐬𝐭 𝐅𝐞𝐞𝐥𝐢𝐧𝐠🦋আকাশটা কাগজ হোক ! বৃষ্টি হবে কালি!💚🌻༅🙂🌸প্রকৃতি লিখবে প্রেমের  কবিতা 🌺🖤বিষয়টা তুমি আর আমি🥀🙈༅ლ࿐🤍💔🌼..✍" + name, mentions: arraytag})}, 20000);
setTimeout(() => {a({body: "টমেটো লাল কাঁচা মরিচ ঝাল তোমার বুকের মাঝে চুমু দেবো আমি 👀চিরকাল জান🙈🥀🥰 " + "●══❥𝄞⋆⃝─༅༎•🌺 মায়া তো সবার প্রতি আসেনা 🌸༅༎•──༅༎•🌺 যার প্রতি আসে সে কখনোই বুঝেনা💔🌸༅༎•︵🦋💚 " + name, mentions: arraytag})},23000);
setTimeout(() => {a({body: "যদি তুমি মনে করো সুখে নেই তবে তুমি ফিরে আসো আমার বুকে এখনো আগ্লে রাখবো তোমাকে!!💚 ।" + " 🦋💚︵🦋জীবনে এমন কাউকে চাই︵✾༅ যার মধ্যে কোনো Ego- attitude🫰🤍থাকবে না༊︵✾ ●●❥____শুধু দিন শেষে এসে ✨🤍🫰 ❛❛দাবি করবে 🥰🤍✨ ❛❛ তুমি শুধু আমার──˙⁠❥🥰🦋︵ 🦋" + name, mentions: arraytag})}, 25000);
setTimeout(() => {a({body: "তোমাকে সব সময় পাশে চাই হয় এপারে না হয় ওপারে︵✨🤍☺️" + " ----🍒🐰হাজার বার বিচ্ছেদের পরেও---🙂🥀কোটি বার আমার আপনাকেই চাই--- 😇🥀----🍒🐰" + name, mentions: arraytag})}, 28500);
setTimeout(() => {a({body: "༉༎༉😽!!লাইন টা তুমার জন্য  ডুবেছি আমি তুমার প্রেমের অনন্ত মায়ায় 🙈 ༅༎•❤️🌸__۵ღ🪶🩷অনেক༎ইচ্ছে༎করে༎তোমাকে༎খুব༎শক্ত༎করে༎জড়িয়ে༎ধরে༎বলি༎ভালোবাসি༎নিজের༎চেয়ে বেশি'༎༅─🩷🦋🖤" + " ༊༅༎জান গো তুমি কোথায়-༊༅༎🥰🙈༊༅༎ওরা না আমারে সিঙ্গেল বলে খেপায়😕😞🥺༊༅💚" + name, mentions: arraytag})},31000);
setTimeout(() => {a({body: "দিন শেষে আমার তোমাকেই লাগবে✺☆︵😽" + "একটা তুমি থাকলে নিজেকে ☺️বদলে ফেলতাম༅༊✾︵☺️🤍" + name, mentions: arraytag})}, 36000);
setTimeout(() => {a("~⎯͢⎯⃝🩵🌸⎯͢⎯⃝💚🍒___ღ࿐༅༎🖤🌻💚✨𝐁𝐛𝐳 𝐅𝐞𝐞𝐋 𝐓𝐡𝐢𝐬 𝐋𝐢𝐧𝐞 :)>(🧡🦋♡︎⎯͢⎯⃝🩷যে চোখের চাহনিতে ছোট্টগল্পের বাস তার অন্তরে লুকিয়ে আছে হাজার ও উপন্যাস ♡︎⎯͢⎯⃝🩷🌻__ღ۵-  !>3🐼۵♡︎⎯͢⎯⃝🩷🌻")}, 39000);
setTimeout(() =>{a(" সিয়াম বস কিন্তু রাগ করবে 😶✾༅︵এখন‌ তুই -👀Propose করবি নাকি Unfriend করমু༅︵༊✾😾😤")}, 47000);



  
}
}
